In [5]:
import pandas as pd
data=pd.read_csv("pandas lab.csv")

In [6]:
print(data)

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
0   s180890  M.pravallika    CSE    2D     80    8688345596
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252
2   S180282     S.Mounika    CSE    2D     91    9215436579
3   S180081  P.Geetha sri    CSE    2A     94    7657469534

In [7]:
data["MARKS"].max()

94

In [8]:
data["MARKS"].min()

80

In [9]:
data.head(3)

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
0   s180890  M.pravallika    CSE    2D     80    8688345596
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252
2   S180282     S.Mounika    CSE    2D     91    9215436579

In [10]:
data.tail(3)

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252
2   S180282     S.Mounika    CSE    2D     91    9215436579
3   S180081  P.Geetha sri    CSE    2A     94    7657469534

In [11]:
data[["ID NUMBER","NAME"]]

  ID NUMBER          NAME
0   s180890  M.pravallika
1   S180920   G.Bhulekhya
2   S180282     S.Mounika
3   S180081  P.Geetha sri

In [12]:
data["MARKS"]>100

0    False
1    False
2    False
3    False
Name: MARKS, dtype: bool

In [13]:
data["MARKS"]<100

0    True
1    True
2    True
3    True
Name: MARKS, dtype: bool

In [14]:
data[data["MARKS"]>90]

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
2   S180282     S.Mounika    CSE    2D     91    9215436579
3   S180081  P.Geetha sri    CSE    2A     94    7657469534

In [15]:
data.describe()

           MARKS  PHONE NUMBER
count   4.000000  4.000000e+00
mean   88.750000  8.239495e+09
std     6.075909  8.569202e+08
min    80.000000  7.396729e+09
25%    87.500000  7.592284e+09
50%    90.500000  8.172908e+09
75%    91.750000  8.820118e+09
max    94.000000  9.215437e+09

In [16]:
type(data)

pandas.core.frame.DataFrame

In [18]:
d=data.head(3)
print(d)

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
0   s180890  M.pravallika    CSE    2D     80    8688345596
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252
2   S180282     S.Mounika    CSE    2D     91    9215436579

In [20]:
a=d.tail(2)
a

  ID NUMBER         NAME BRANCH CLASS  MARKS  PHONE NUMBER
1   S180920  G.Bhulekhya    CSE    2D     90    7396729252
2   S180282    S.Mounika    CSE    2D     91    9215436579

In [21]:
import pandas as pd
data=pd.read_csv("pandas lab.csv")
print(data)
data["address"]=["Konanki","Visanna peta","Amalapuram","Srikakulam"]
data

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER
0   s180890  M.pravallika    CSE    2D     80    8688345596
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252
2   S180282     S.Mounika    CSE    2D     91    9215436579
3   S180081  P.Geetha sri    CSE    2A     94    7657469534

  ID NUMBER          NAME BRANCH CLASS  MARKS  PHONE NUMBER       address
0   s180890  M.pravallika    CSE    2D     80    8688345596       Konanki
1   S180920   G.Bhulekhya    CSE    2D     90    7396729252  Visanna peta
2   S180282     S.Mounika    CSE    2D     91    9215436579    Amalapuram
3   S180081  P.Geetha sri    CSE    2A     94    7657469534    Srikakulam

In [22]:
data.loc[1]

ID NUMBER            S180920
NAME             G.Bhulekhya
BRANCH                   CSE
CLASS                     2D
MARKS                     90
PHONE NUMBER      7396729252
address         Visanna peta
Name: 1, dtype: object

In [23]:
data.loc[1,"name"]

KeyError: 'name'

In [24]:
data.loc[1,"NAME"]

'G.Bhulekhya'

In [25]:
import pandas as pd
data=pd.read_csv("pandas lab.csv",index_col=0)
data

                   NAME BRANCH CLASS  MARKS  PHONE NUMBER
ID NUMBER
s180890    M.pravallika    CSE    2D     80    8688345596
S180920     G.Bhulekhya    CSE    2D     90    7396729252
S180282       S.Mounika    CSE    2D     91    9215436579
S180081    P.Geetha sri    CSE    2A     94    7657469534